{"https://taxstrategistsofamerica.com/terms-and-conditions": "Terms and Conditions | Tax Strategists of America\nBlogPartnersServicesHomeContactAboutTerms & ConditionsThese terms and conditions govern your use of this web site and our membership site(s). By accessing this web site and/or our membership site(s), you are acknowledging and accepting these terms and conditions. These terms and conditions are subject to change by Tax Strategists of America LLC (hereinafter “Company”) at any time and at our discretion without notice. Your use of this web site and/or our membership site(s) after any changes are implemented constitutes your acceptance of the changes. As a result, we encourage you to consult the terms and conditions each time you use this web site and/or our membership site(s). First and foremost any information provided on this site or in any of our membership groups/courses are meant for informational purposes ONLY. Please consult with a professional before taking any advice offered. INTELLECTUAL PROPERTYYou acknowledge and agree that all content and materials available on this site are protected by copyrights, trademarks, service marks, patents, trade secrets, or other proprietary rights and laws. Except as expressly authorized by COMPANY, you agree not to sell, license, rent, modify, distribute, copy, reproduce, transmit, publicly display, publicly perform, publish, adapt, edit, or create derivative works from such materials or content.As noted above, reproduction, copying, or redistribution for commercial purposes of any materials or design elements on this site is strictly prohibited without the express written permission of COMPANY. For information on requesting such permission, please contact us at support@taxstrategistsofamerica.comTHIRD PARTY REFERENCES / HYPERLINKSThis site and/or our membership site(s) may link you to other sites on the Internet. These sites may contain information or material that some people may find inappropriate or offensive. These other sites are not under the control of COMPANY, and you acknowledge that COMPANY is not responsible for the accuracy, copyright compliance, legality, decency, or any other aspect of the content of such sites. The inclusion of such a link does not imply endorsement of the site by or any association with its operators. However, we may from time to time be compensated for referring you to certain vendors, and in such circumstances, we will let you know of that relationship.MEMBERSHIP PROGRAM(S)PRICINGCOMPANY may offer one or more membership programs on this web site. The pricing for any such membership program will be clearly stated on the applicable order form.DISCLOSURE OF INFORMATION ON PRIVATE MEMBERSHIP SITEAs a member of one of the membership programs offered by COMPANY, you may submit content to the membership site, including photos and user comments. You shall be solely responsible for your own content and the consequences of submitting and publishing your content.You further agree and understand that other individual members of the program that are separate from COMPANY may see the information that you post on any applicable membership site. For this reason, you agree that you shall NOT post any information that you do not want others to see. You agree that anything you post in the applicable membership site is at your own risk, and you further agree to hold COMPANY harmless from any and all damage that could occur to you from any information that you post. For additional details, please see our Privacy Policy.You affirm, represent, and warrant that you own or have the necessary licenses, rights, consents, and permissions to publish content you submit. You agree that content you submit will not contain third party copyrighted material, or material that is subject to other third party proprietary rights, unless you have permission from the rightful owner of the material or you are otherwise legally entitled to post the material and to grant COMPANY all of the license rights granted herein. COMPANY does not endorse any content submitted to COMPANY by any user or other licensor.YOUR CONDUCTCOMPANY does not permit copyright infringing activities and infringement of intellectual property rights on this site and/or membership site(s), and COMPANY will remove all content if properly notified that such content infringes on another’s intellectual property rights.You also affirm, represent, and warrant that your participation on this web site and/or in the membership program(s) and the content you submit does not relate to pornography, illegal activities of any kind, occult, hate, or racism. You also affirm, represent, and warrant that you shall not make any statements or take any actions against COMPANY or other members that would constitute libel or slander.COMPANY reserves the right to make the final decision regarding what is appropriate. COMPANY further reserves the right to remove content or terminate your account without prior notice for a violation of this provision.Further details regarding the conduct that is expected of all participants in the membership program can also be found in the first post that you will find inside the membership site.TERMINATION OF MEMBERSHIPCOMPANY’s refund policy is described in further detail below.REFUND POLICYCOMPANY offers a 30 day money back guarantee, please email support@taxstrategistsofamerica.com for refund.CUSTOMER DISCLAIMERSCOMPANY Website and membership groups are not intended to provide any tax, legal, financial planning, insurance, accounting, investment, or any other kind of professional advice or services, and nothing on the website or in the membership groups should be construed as an offer to sell, a solicitation of an offer to buy, or a recommendation for any security, insurance policy, or investment strategy. To make sure that any information or suggestions on this site or in our groups fit your particular circumstances, you should consult with an appropriate tax or legal professional before taking action based on any suggestions or information on this site. Unless otherwise specified, you alone are solely responsible for determining whether any financial or insurance strategy, product or service, is appropriate or suitable for you based on your investment objectives and personal and financial situation.Without limiting the foregoing, no product or service offered or set forth on this Website, nor any analysis, commentary, or otherwise (whether oral or written), provided in conjunction with the foregoing shall be deemed to constitute: (1) investment advice under applicable state or federal law, including, but not limited to, the Investment Advisers Act or 1940; or (2) any sort of transaction in securities for the account of others, including, but not limited to, any solicitation, negotiation or execution of the transaction. Neither we nor any of our representatives, sublicensees, or assigns shall be responsible for any investment decisions or third party damages or losses resulting from the use of such product(s) or service(s) or any information provided in conjunction with same. You also understand and agree that we are not (1) an “investment adviser” as such term is defined in the federal Investment Advisers Act of 1940, or (2) a “broker”, or (3) a “dealer”, as such terms are defined under the federal Securities Exchange Act of 1934. We do not hold ourselves out in any communications as an investment adviser, a broker, or a dealer.COMPANY is not acting as a financial or legal advisor and does not guarantee that you will achieve any particular result from participating in any of COMPANY’s membership programs or from using any of the information on this site. Please see our complete earnings disclaimers for details.ABILITY TO ACCEPT TERMS AND CONDITIONSYou affirm that you are either more than 18 years of age, or an emancipated minor, or possess legal parental or guardian consent, and are fully able and competent to enter into the terms, conditions, obligations, affirmations, representations, and warranties set forth in these Terms and Conditions, and to abide by and comply with these Terms and Conditions.CONTACTING USIf you need to contact us, you can email us at support@taxstrategistsofamerica.com, or send us a letter at: PO Box 770, Rison, AR 71665.DISCLAIMER OF WARRANTIESALL MATERIALS, INFORMATION, SOFTWARE, PRODUCTS, AND SERVICES INCLUDED IN OR AVAILABLE THROUGH THIS SITE (THE “CONTENT”) ARE PROVIDED “AS IS” AND “AS AVAILABLE” FOR YOUR USE. THE CONTENT IS PROVIDED WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NONINFRINGEMENT. COMPANY AND ITS AGENTS DO NOT WARRANT THAT THE CONTENT IS ACCURATE, RELIABLE OR CORRECT; THAT THIS SITE WILL BE AVAILABLE AT ANY PARTICULAR TIME OR LOCATION; THAT ANY DEFECTS OR ERRORS WILL BE CORRECTED; OR THAT THE CONTENT IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. YOUR USE OF THIS SITE IS SOLELY AT YOUR RISK. BECAUSE SOME JURISDICTIONS DO NOT PERMIT THE EXCLUSION OF CERTAIN WARRANTIES, THESE EXCLUSIONS MAY NOT APPLY TO YOU.LIMITATION OF LIABILITYUNDER NO CIRCUMSTANCES SHALL COMPANY OR ITS AGENTS BE LIABLE FOR ANY DIRECT, INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES THAT RESULT FROM THE USE OF, OR INABILITY TO USE, THIS SITE. THIS LIMITATION APPLIES WHETHER THE ALLEGED LIABILITY IS BASED ON CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, OR ANY OTHER BASIS, EVEN IF COMPANY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. BECAUSE SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, COMPANY’S LIABILITY IN SUCH JURISDICTIONS SHALL BE LIMITED TO THE EXTENT PERMITTED BY LAW.However, IN NO EVENT SHALL TAX STRATEGISTS OF AMERICA LLC’S TOTAL LIABILITY TO YOU FOR DAMAGES, LOSSES AND CAUSES OF ACTION (WHETHER IN CONTRACT OR IN TORT, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE, OR OTHERWISE) EXCEED THE AMOUNT PAID BY YOU, IF ANY, FOR ACCESSING THE SITE.INDEMNIFICATIONUpon a request by COMPANY, you agree to defend, indemnify, and hold COMPANY and its other affiliated companies harmless, and their employees, contractors, officers, and directors from all liabilities, claims, and expenses, including attorney’s fees, that arise from your misuse of this site and/or the membership programs.THIS AGREEMENT PROVIDES FOR THE MANDATORY ARBITRATION OF DISPUTES, AND INCLUDES A WAIVER OF THE RIGHT TO A JURY TRIAL AND A CLASS ACTION WAIVER, AS SET FORTH BELOW.If you have a dispute with Tax Strategists of America LLC, and you are unable to resolve the dispute informally, you and Tax Strategists of America LLC agree that upon demand by either you or Tax Strategists of America LLC, the dispute will be resolved through binding arbitration. As the sole exception to arbitration, you and Tax Strategists of America LLC each retain the right to pursue in small claims court any dispute that is within that court’s jurisdiction. A “dispute” is any unresolved disagreement between you and Tax Strategists of America LLC, regardless of when the claim arose, and includes claims based on contracts, torts, statutes, regulations, common law, and equitable claims. All statutes of limitation applicable to any dispute shall apply in any arbitration between you and Tax Strategists of America LLC.You and Tax Strategists of America LLC agree that you are each waiving the right to a jury trial or a trial before a judge in a court. You and Tax Strategists of America LLC agree that each may bring claims against the other only in an individual capacity, and that neither you nor Tax Strategists of America LLC shall be entitled to join or consolidate claims by or against others in any arbitration, or to include in any arbitration any dispute as a representative or member of a class, or on behalf of the general public, or as a private attorney general. If this limitation is found to be unenforceable, it shall not be severable, and this entire arbitration provision shall be unenforceable. You and Tax Strategists of America LLC agree that the arbitrator may award injunctive relief only in favor of the party seeking relief, and only to the extent necessary to provide relief warranted by that party’s individual claim. In the event of any inconsistency between this arbitration provision and any provision contained in any other applicable terms of use, license agreement, disclaimer, or privacy policy relating to Tax Strategists of America LLC or the material on the website, this arbitration provision shall be controlling.Last Revised: July 11, 2022BlogPartnersServicesHome© 2022 Copyright of Tax Strategists Of AmericaAll Rights Reserved© 2022 Copyright of Tax Strategists Of America | All Rights Reserved  -  Want a website like MINE? Check out:352-639-4616Disclaimer  |  Privacy policy   |   terms of service  |  Affiliate programContactAboutText us yourquestions:"}