{"https://taxstrategistsofamerica.com/about": "About | Tax Strategists of America\nBlogPartnersServicesHomeContactAboutAbout UsWhat does TSOA do?What doesTSOA do?Founded by a former IRS agent, Tax Strategists of America was created to analyze and implement tax strategies. The only firm in the nation to provide ongoing tax strategy implementation, our mission at TSOA is to help you pay the least tax legally possible!99% of the tax law is devoted to Government deductions and credits for business owners and investors. Tax Strategy is simply finding the deductions that you qualify for and taking the necessary steps to deduct the expense or take the credit on your return. Tax Strategy is also being proactive about purchases, investments, etc so that you can take advantage of the maximum deductions or credits available to you. For instance, which vehicle to purchase. Should you purchase a AirBNB or piece of machinery? Should you purchase a long term rental or short term rental? What isTax Strategy? What is Tax Strategy? our TeamBrooke AllisonPublic Relations Specialiststatus and thoroughly loves giving guests a memorable experience in their vacation rental homes. Brooke believes that multiple streams of income is very important to achieve generational wealth. She has an amazing husband, Jason and two sons, Reid and Rhett. She enjoys spending time with her family outdoors, kayaking, riding four wheelers, going to the lake, and participating in church activities. Katherine HamlinTax StrategistKatherine is a native of Upstate NY with a Bachelor’s Degree in Accounting from SUNY Polytechnic Institute. Katy has over 10 years experience and is committed to helping business owners with their financial goals and saving money on their taxes. In her spare time, Katy enjoys spending time with her family camping, boating, and snowmobiling!Carlotta ThompsonFounder + CEOShortly after attaining her dream of working for the IRS, Carlotta realized that the IRS isn’t actually in place to help small businesses like she’d thought and it felt like she was working for the wrong side. As an auditor, she saw tons of tax returns with sometimes hundreds of thousands of dollars of missed deductions that were detrimental for the client. Carlotta had a bigger dream and mission to directly help business owners pay the least tax legally possible, so what began as a ministry has evolved into Tax Strategists of America! In her spare time, Carlotta enjoys spending time with her husband and three children. Pamela NicholsWarrior GuideAllison RinehimerBusiness OperationsIn January of 2021, Savannah became captivated with the mission of helping business owners pay less tax so they can give back to their specific missions, and began working for Carlotta Thompson & Associates in Customer Service. Developing a passion for bringing awareness and educating, Savannah stepped into Marketing with CTA and found her niche. Working closely with Carlotta, Savannah became enthralled with learning tax strategy, business operations, and assisting Carlotta with implementing her ideas. Thus, in January of 2022, while most were sleeping during the night, Carlotta and Savannah built Tax Strategists of America. Besides helping business owners pay the least tax legally possible, Savannah is passionate about Ministry, Mental Health Awareness, and children in Foster Care. In her spare time, she is probably snuggling her one-eyed cat, Tiger and thinking about business. Allison Rinehimer to implement strategies to help them pay the least tax legally possible.Allison graduated from Washington & Jefferson College where she was awarded the PICPA Outstanding Senior Award as the top student in her graduating accounting class.When Carlotta was 14, she remembers becoming enthralled with a booklet on preparing taxes. She decided then that she wanted to work for the IRS, so at 14 years old, she began studying tax law with the dream of working for the Internal Revenue Service (IRS).  Savannah ShanklesVP of MediaPamela continues to learn tax strategy while working closely with Carlotta and the TSOA team. Pamela is an integral part of the team in initiating clients through the process here at TSOA. In her spare time, Pamela loves spending time with her family, she adores her dog Cooper, and enjoys spending time outdoors.Pamela is the Wealth Warrior for Tax Strategists of America.  She has been featured as being  one of the youngest to ever complete the QuickBook Pro Certification. Pamela is being coached and mentored on business acquisitions by the king of acquisitions, Kyle Mallien. She is receiving operations training from Alex Charfen. Shortly after graduating, she obtained her CPA license and worked in the accounting field. She has 9 years of experience in bookkeeping, payroll processing, and tax preparation.She grew up in a family of small business owners, so she was immersed in the world of business from a young age. Her upbringing has instilled a strong appreciation for the hardwork and dedication it takes to run a business, and it drives her passion to help her clients pay the least tax legally possible. She prides herself on finding unique ways to help our clients at Tax Strategists of America save money and pay the least tax legally possible. Outside of work, Allison enjoys spending time with her family, exploring the outdoors with her dog, and traveling to experience new places.For as long as Savannah can remember, she has felt a calling to serve others and make a difference in her community. Following that passion, she graduated from the University of Central Arkansas with a Bachelors in Psychology, minoring in Addiction Studies, while volunteering as a Crisis Counselor for a National Hotline. Client turned Public Relations Specialist, Brooke is an asset to our team. She believes that tax strategy can change your financial future and help you keep your hard-earned money. Brooke is also currently a real estate professional with long-term and short-term rentals in which her family works together. She quickly achieved AirBnB “Super host” and VRBO “Premier Host”Refer A Friendrefer friends and get rewardedJoin our affiliate partners and receive up to $1,500 for every client referral that hires us. Join our group to get started by clicking below...Join our affiliate partners and receive up to $1,500 for every client referral that hires us.Join our group to get started by clicking below...affiliatesJoin our affiliate Group on facebookBlogPartnersServicesHome© 2022 Copyright of Tax Strategists Of AmericaAll Rights Reserved© 2022 Copyright of Tax Strategists Of America | All Rights Reserved  -  Want a website like MINE? Check out:352-639-4616Disclaimer  |  Privacy policy   |   terms of service  |  Affiliate programContactAboutText us yourquestions:"}