{"https://taxstrategistsofamerica.com/privacy-policy": "Privacy Policy | Tax Strategists of America\nBlogPartnersServicesHomeContactAboutPrivacy PolicyThank you so much for visiting this site owned by Tax Strategists of America LLC. We want to make sure you understand that we take your privacy serious. Thank you for trusting us with your information. We have created this policy to let you know what steps we have taken to safeguard that information. The goal is for this information to be easy to read and understand. If you have any questions you can always send us an email at support@taxstrategistsofamerica.comPlease read this Privacy Policy before using this site or submitting any personal information. By using this web site, you accept the privacy practices contained in this Privacy Policy. These privacy practices may change from time to time, but any changes will be posted. You are encouraged to review the Privacy Policy whenever you visit the web site to make sure you understand how any personal information you provide will be used.COLLECTED INFORMATIONIn certain instances, you may be asked to provide personal information on our site. This information is for administrative or transaction use only. We use it to fulfill orders you have placed, better understand and serve your needs, and provide services tailored to you.Non-personally identifiable information may be collected by our web-based tools for the purpose of online advertising and is completely anonymous. This information may include such information as your IP address, date and time of visit, domain type, and their activity on our website. None of this information, individually or grouped together, can be traced back to you as an individual.For example, we may use session and persistent “cookies,” session logs, web beacons, GIF/pixel tags, banner ads, third-party click tracking analytics tools (such as Google Analytics), third party retargeting networks that may display our advertisements to you on other sites that you visit to remind you about us, and third party networks that serve user-requested emails (e.g., for a refer-a-friend email) to collect non-personally identifiable or other aggregated information about site visitors.Emails or newsletters that we send electronically may use techniques such as web beacons or pixel tags to gather email metrics and information to improve the reader’s experience, such as the number of emails that are opened, whether they were forwarded or printed, the type of device from which they were opened, and the location (e.g. city, state, and county) associated with the applicable IP address.If you visit this site with an open ID (such as Facebook), you may also be sharing and integrating data with third-party social media sites, and we may track aggregate data about the number of visits to this site with an open ID, the number of items “liked” on this site, or items on this site that you choose to share with a third-party social media site.Other parties such as advertising partners and analytics companies may also be collecting information about your online activity across various websites over time. The information collected by those third parties may include identifiers that allow those third parties to tailor the ads that they serve to your computer or other device. Because there is not yet a common understanding of how to interpret web browser-based “Do Not Track” signals other than cookies, we do not currently respond to “Do Not Track” signals that are undefined.Please note that you do have the option to configure most web browsers to NOT accept cookies. However, be aware that disabling cookies may keep you from having access to some functions or services on our web site or the web-hosted software that runs on our web site.Bottom line…most all websites use the same technology to better serve and market to their customers. If you have any questions, please feel free to message us at support@taxstrategistsofamerica.comPERSONALLY IDENTIFIABLE INFORMATIONWe do not use your information for any purpose without your consent. Your information will not be accessible to anyone other than our staff or business affiliates whose services you have requested. We will only use your personal information for the following purposes: (1) to deliver the products and/or services to you that you have requested; (2) to validate your compliance with the terms and conditions; (3) for content improvement and feedback purposes; (4) to reach you, when necessary, regarding your use of the web site or product(s); and (5) for the few situations described below to better serve you.We will NEVER share your personally identifiable information with third parties unless you have given us explicit permission to do so, such as in order to fulfill a third party offer that you have accepted from us. However, by permitting us to collect this information, you will be able to receive information on other products and services that may be of interest to you, including related third party offers that we may send directly to you. You also enable us to personalize your experience with us so that we can provide you with the highest quality of service.By submitting your email address on this web site, you agree to receive email from Tax Strategists of America LLC. You can cancel your participation in any of these email lists at any time by clicking the opt-out link or other unsubscribe option that is included in the respective email. We only send emails to people who have authorized us to contact them, either directly, or through a third party. We do not send unsolicited commercial emails, because we hate spam as much as you do.By participating in one of our membership programs, you agree and understand that other members of the program may see the comments, questions, photos, and/or other documents that you post on the membership site, as well as any responses to you that are posted by Tax Strategists of America LLC or other members. If you do not want your personal details revealed to other members of the program, then please do not post any such information through the membership site.In addition, you agree that by submitting your telephone contact information on this web site and/or registering to receive the product and/or service offered herein, such act constitutes a purchase, an inquiry, and/or an application for the purposes of the Amended Telemarketing Sales Rule (ATSR), 16 CFR ‘310 et seq. and any applicable state and local “do not call” regulations. We retain the right to contact you via telemarketing in accordance with the ATSR and the applicable state regulations.Also, we will have to hand over the information you provide if we’re ordered to do so by a court of law.SECURITYWe are determined to keep your information private. All information collected from you is stored in a technically and physically secure environment. Furthermore, employees, contractors, and vendors who have access to your personally identifiable information in connection with providing services for us are required to keep the information confidential.We use vendors that specialize in providing secure online payment solutions. We do everything we can to protect user information online and offline. Unfortunately, no transmission over the Internet can be guaranteed to be 100% secure. As a result, while we take reasonable measures to protect your information, we cannot ensure or warrant the security of the information that you transmit to us, and you do so at your own risk.THIRD PARTY ACTIONSWe do not control and are not liable for the actions of any third parties who we may promote. We pride ourselves in working with quality companies, but have no control over the actions of those third parties. While we are not liable for any of the actions of those third parties, you should feel free to give us feedback from time to time on your experiences with any third parties to whom we work with so that we may enhance our future service to all customers.CHILDREN'S PRIVACYWe do not knowingly intend to collect personally identifiable information from children under 18 years of age. If your minor child has provided us with personally identifiable information, you may contact us at the phone number or mailing address listed in Section 7 herein if you want this information deleted from our records. We will then make reasonable efforts to remove your child’s information from the database that stores the information.IP ADDRESSESWe may use your IP address to help prevent fraud, to help diagnose problems with our server, to gather broad demographic information, and to offer you products and services.Third Party Web SitesThis web site and/or the products and/or services offered herein may direct you to web sites that are owned and/or controlled by third parties. We have no control over those third parties and are not responsible for the content or the privacy practices of those sites or companies.CONTACTPlease contact us if you have any questions or concerns about our privacy policy. You can contact us at support@taxstrategistsofamerica.com or send us a letter atTax Strategists of America LLC  PO Box 770 Rison, AR 71665We strive to provide excellent products, along with equally excellent customer service. If you have any questions about this Privacy Policy or our practices, please feel free to contact us using one of the methods listed above.BlogPartnersServicesHome© 2022 Copyright of Tax Strategists Of AmericaAll Rights Reserved© 2022 Copyright of Tax Strategists Of America | All Rights Reserved  -  Want a website like MINE? Check out:352-639-4616Disclaimer  |  Privacy policy   |   terms of service  |  Affiliate programContactAboutText us yourquestions:"}