{"https://taxstrategistsofamerica.com/disclaimer": "Disclaimer | Tax Strategists of America\nBlogPartnersServicesHomeContactAboutDisclaimerTax Strategists of America LLC, Its owners (including, but not limited to Carlotta Thompson), officers, directors, employees, subsidiaries, affiliates, licensors, service providers, and agents (hereinafter “Carlotta Thompson”) are not YOUR financial advisors, and nothing contained on this web site or part of the membership program is intended to be financial advice. Tax Strategists of America LLC is NOT an investment advisory service, NOT an investment advisor, and does NOT serve as a financial advisor or provide personalized financial advice in any way. The information provided by the author is from years of experience and are the personal opinions of the author.Furthermore, the services, strategies, information, and/or products offered by Tax Strategists of America LLC on this web site, through the membership program, and/or elsewhere are not to be interpreted as a promise or guarantee of earnings or any specific result.The education and information presented by Tax Strategists of America LLC is intended for a general audience and does not purport to be, nor should it be construed as, specific financial, legal, or other advice tailored to any individual. You are encouraged to discuss any opportunities with your attorney, accountant, financial professional, or other advisor.In fact, your personal level of success in attaining the results from using our information, strategies, and/or products totally depends upon your own individual circumstances, the effort you devote to your own financial success, the ideas and techniques used, your finances, the various strategies that your financial, legal, and other advisors may have suggested that you implement, your knowledge, and various other skills. Since these factors differ among each individual, we cannot guarantee your success or income level, nor are we responsible for any of your actions.Any and all forward-looking statements on this web site, membership program, and/or in any of our products are intended to express our opinion of the earnings potential or savings that some people may achieve. To the extent that we included any case studies or testimonials on this site, you can assume that none of these stories in any way represent the “average” or “typical” customer experience.Even though Tax Strategists of America LLC makes no guarantees that you will achieve any particular result from using this information, you can still take advantage of Tax Strategists of America LLC’s refund policy if you are not completely satisfied within the 30 day grace period. In such instances, you can request a refund according to the terms and timelines indicated in the refund policy described in the Terms and Conditions section on this site.Tax Strategists of America LLC may derive fees or other compensation as a result of purchases from service providers or vendors that are recommended from this site and/or membership program.YOU FULLY AGREE AND UNDERSTAND THAT TAX STRATEGISTS OF AMERICA LLC IS NOT RESPONSIBLE FOR YOUR SUCCESS OR FAILURE AND MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND WHATSOEVER THAT OUR PRODUCTS OR SERVICES WILL PRODUCE ANY PARTICULAR RESULT FOR YOU.YOUR USE OF THE INFORMATION CONTAINED ON THIS WEB SITE AND/OR MEMBERSHIP PROGRAM IS AT YOUR OWN RISK. THE CONTENT IS PROVIDED ‘AS IS’ AND WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESSED OR IMPLIED. TAX STRATEGISTS OF AMERICA LLC DISCLAIMS ALL WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, OR NON-INFRINGEMENT. TAX STRATEGISTS OF AMERICA LLC DOES NOT PROMISE OR GUARANTEE ANY INCOME, SAVINGS OR PARTICULAR RESULT FROM YOUR USE OF THE INFORMATION CONTAINED ON THIS WEB SITE AND/OR MEMBERSHIP PROGRAM. TAX STRATEGISTS OF AMERICA LLC ASSUMES NO LIABILITY OR RESPONSIBILITY FOR ERRORS OR OMISSIONS IN THE INFORMATION CONTAINED ON THIS WEB SITE AND/OR MEMBERSHIP PROGRAM.TAX STRATEGISTS OF AMERICA LLC WILL NOT BE LIABLE FOR ANY INCIDENTAL, DIRECT, INDIRECT, PUNITIVE, ACTUAL, CONSEQUENTIAL, SPECIAL, EXEMPLARY, OR OTHER DAMAGES, INCLUDING, BUT NOT LIMITED TO, LOSS OF REVENUE OR INCOME, PAIN AND SUFFERING, EMOTIONAL DISTRESS, OR SIMILAR DAMAGES, EVEN IF TAX STRATEGISTS OF AMERICA LLC HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT WILL THE COLLECTIVE LIABILITY OF TAX STRATEGISTS OF AMERICA LLC TO ANY PARTY (REGARDLESS OF THE FORM OF ACTION, WHETHER IN CONTRACT, TORT, OR OTHERWISE) EXCEED THE GREATER OF $100 OR THE AMOUNT YOU HAVE PAID TO TAX STRATEGISTS OF AMERICA LLC FOR THE INFORMATION, PRODUCT OR SERVICE OUT OF WHICH LIABILITY AROSE.UNDER NO CIRCUMSTANCES WILL TAX STRATEGISTS OF AMERICA LLC BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY YOUR RELIANCE ON THE INFORMATION CONTAINED ON THIS WEB SITE AND/OR MEMBERSHIP PROGRAM. IT IS YOUR RESPONSIBILITY TO EVALUATE THE ACCURACY, COMPLETENESS OR USEFULNESS OF ANY INFORMATION, OPINION, ADVICE OR OTHER CONTENT CONTAINED ON THIS WEB SITE AND/OR MEMBERSHIP PROGRAM. PLEASE SEEK THE ADVICE OF PROFESSIONALS, AS APPROPRIATE, REGARDING THE EVALUATION OF ANY SPECIFIC INFORMATION, OPINION, ADVICE OR OTHER CONTENT.Last Revised: July 11, 2022BlogPartnersServicesHome© 2022 Copyright of Tax Strategists Of AmericaAll Rights Reserved© 2022 Copyright of Tax Strategists Of America | All Rights Reserved  -  Want a website like MINE? Check out:352-639-4616Disclaimer  |  Privacy policy   |   terms of service  |  Affiliate programContactAboutText us yourquestions:"}